Revit 2027 API
Subelement.Element Property
 The element in which the subelement resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element Element { get; }
Public ReadOnly Property Element As Element
	Get
public:
property Element^ Element {
	Element^ get ();
}
member Element : Element with get
Property Value
Element
Remarks
 If subelement refers to whole element, this element is returned.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace